src/content/docs/developers/Fame.md
```mermaid
classDiagram
    class Element {
        +String fullname
        +String name
    }

    class Type {
        <<abstract>>
    }

    class Class {
        +Boolean abstract
        +Boolean root
        +Boolean primitive
    }

    class Trait {
        +Boolean root
        +Boolean primitive
    }

    class Property {
        +Boolean multivalued
        +Boolean composite
        +Boolean container
        +Boolean derived
    }

    class Boolean
    class Number
    class String
    class Object
    class Package

    Element <|-- Type
    Type <|-- Class
    Type <|-- Trait
    Element <|-- Package
    Element <|-- Property
    Class <|-- Boolean
    Class <|-- Number
    Class <|-- String
    Class <|-- Object

    Element --> Element
    Type "1" *-- "0..*" Property
    Type "1" -- "0..*" Trait
    Type "0..*" --* "1" Package
    Class --> Class : superclass
    Class --> Class : subclass
    Package -- "0..*" Property : extensions
    Property --> Property : opposite
    Property --> Object : defaultValue
```
